# Print Method (ViewSet, View)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..Print Method (ViewSet, View)
Document Class See Also
---
Prints a set of views with a specified view template and default print settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Print(
	ViewSet views,
	View viewTemplate
)
```

Visual Basic
---
```text
Public Sub Print ( _
	views As ViewSet, _
	viewTemplate As View _
)
```

Visual C++
---
```text
public:
void Print(
	ViewSet^ views,
	View^ viewTemplate
)
```

# ### Parameters
views
    Type: Autodesk.Revit.DB..::..ViewSetThe set of views which need to be printed.
viewTemplate
    Type: Autodesk.Revit.DB..::..ViewThe view template which apply to the set of views.
# Remarks
If one view in the set can not be printed successfully then an exception will be thrown.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when printing is not allowed in the current application mode. Or when at least one view from the view set is not a printable view. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the view set to be printed is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the view set contains a nullNothingnullptra null reference (Nothing in Visual Basic) element. |
| Autodesk.Revit.Exceptions..::..ApplicationException | Thrown when at least one view from the view set could not be printed. |
| Autodesk.Revit.Exceptions..::..OperationCanceledException | Thrown when print is cancelled by event handler. |

# See Also
Document Class
Print Overload
Autodesk.Revit.DB Namespace